resources/recitations/2018/8-Taurus/test_taurus/Taurus-tests/quick_test.yml
execution:
- concurrency: 100
  ramp-up: 1m
  hold-for: 5m
  scenario: quick-test

scenarios:
  quick-test:
    requests:
        - url: http://localhost:8080/api/todos
          method: GET
          extract-jsonpath:
              aa: 
                jsonpath: $[0]._id
                default: NOT_FOUND  # default value to use when jsonpath not found
                from-variable: JM_VAR # JMeter variable for search
                concat: false # \
                scope: all    # - see below
                match-no: 4
        - url: http://localhost:8080/api/todos/${aa}
          method: DELETE